alperbasarn/homio-round-hmi/esp-idf/screen-test/sdkconfig.defaults
# Target board
CONFIG_IDF_TARGET="esp32c6"

# USB Serial/JTAG console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# CPU/flash settings matching the main C6 project defaults
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Single core target
CONFIG_FREERTOS_UNICORE=y
